app/controllers/api/pokemon_controller.rb

  def show
    @pokemon = Pokemon.includes(:items).find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = 5