app/views/api/pokemon/show.json.jbuilder

SELECT "items".* FROM "items" WHERE "items"."pokemon_id" = 5
---
  json.image_url asset_path(@pokemon.image_url)
  json.item_ids @pokemon.items.ids